[
  {
    "permalink": "global-expansion-and-a-facelift",
    "timestamp": "2017-07-08T17:36:00-04:00",
    "title": "Global expansion and a facelift",
    "excerpt":
      "When I first launched PublicNTP with a single NTP server in Chicago, Illinois, I had grand plans for rapid expansion, first across the US, to be quickly followed by exotic locations around the globe I’d always wanted to visit.",
    "image_urls": ["images/servers.png"],
    "content":
      "<h4>Terry D. Ott - 2017-06-17, 4:52pm EDT (UTC -0400)</h4><p>When I first launched PublicNTP with a single NTP server in Chicago, Illinois, I had grand plans for rapid expansion, first across the US, to be quickly followed by exotic locations around the globe I’d always wanted to visit.</p><p>As is often the case, reality ended up diverging quite a bit from the original dreams. :slightly_smiling_face: From the launch in 2008 through the summer of 2016, PublicNTP was largely in stasis. The server in Chicago was quite reliable/stable over those eight years, but the Chicago deployment was all there was to PublicNTP.</p><p>While my original deployment vision centered around purchasing and installing physical servers in leased data center space, in 2012 the Chicago server was transitioned from a physical server to a cloud-based virtual machine. I was pleasantly surprised to see a virtualized environment was entirely capable of providing high-quality stratum 2 time data to clients.</p><p>Many NTP information sources strongly discourage running NTPd on anything but bare metal hardware. I tend to agree that stratum 1 servers should be running directly on a physical server if possible, but I personally found virtualized NTP server deployments to be entirely well-suited for servicing stratum 2 time needs. As a nice bonus, virtualized deployments were vastly easier to maintain—not to mention significantly cheaper!</p><p>In the summer of 2015, I was sitting at my desk at work looking at the AWS Global Infrastructure map, doing some investigation for my day job. While looking at the map, it hit me that the global nature of AWS data centers could provide the foundation for the first major expansion for PublicNTP.</p><p>A brief investigation demonstrated that, much like I had found with the virtualized server in Chicago, (properly-sized!) EC2 instances proved to be an ideal hosting environment for PublicNTP servers.</p><p>Starting in late July 2016, thanks to Amazon’s EC2 offering, PublicNTP experienced tremendous deployment expansion for the first time in its eight-year history! In just six months, PublicNTP grew from the single deployment in Chicago to 11 deployments across 5 continents:</p><ul><li>North America (4)<li><ul><li>The Dalles, Oregon, USA</li><li>San Jose, California, USA</li><li>Chicago, Illinois, USA</li><li>Ashburn, Virginia, USA</li></ul><li>South America (1)</li><ul><li>São Paulo, Brazil</li></ul><li>Europe (2)</li><ul><li>Dublin, Ireland</li><li>Frankfurt, Germany</li></ul><li>Asia (3)</li><ul><li>Mumbai, India</li><li>Singapore</li><li>Tokyo, Japan</li></ul><li>Australia/Oceania (1)</li><ul><li>Sydney, Australia</li></ul></ul><p></p><p>Starting in the second half of 2016, my long-time friend Scott Waddell and I found ourselves in the same city on a regular basis for the first time in almost twenty years. As we caught up on each others’ lives and interests, I mentioned my work with PublicNTP. Scott immediately grasped the PublicNTP mission and offered to get involved.</p><p>With Scott’s support, we deployed the first-ever PublicNTP stratum 1 time server, a CDMA-based Endrun Technologies Tempus LX server, in Salt Lake City, Utah, USA. Scott also provided access to an excellent technical team, including a graphic designer and a web developer who jointly produced the massive overhaul to the PublicNTP website that you’re currently looking at!</p><p>Stay tuned for more blog posts across the remainder of 2017, which will largely focus on the shared vision Scott and I have for the short- and medium-term evolution/expansion of PublicNTP!</p>",
    "tags": [
      "Time Server Deployments",
      "Mission Statement",
      "Stratum 1",
      "Stratum 2",
      "OCONUS (Non-US) Deployments"
    ]
  },
  {
    "permalink": "donating-time",
    "timestamp": "2018-02-24T14:11:00-05:00",
    "title": "Donating Time",
    "excerpt": "PublicNTP receives federal public charity status",
    "image_urls": ["images/servers.png"],
    "content":
      "<h4>Terry D. Ott - 2018-02-24, 2:11pm EDT (UTC -0400)</h4><p>In 2008, I started PublicNTP as a personal hobby project. Back then, PublicNTP consisted of a small set of cloud-based Network Time Protocol (NTP) servers, all inside the United States, that with the help of hyper-accurate time provided by atomic clocks, provided time references for computers around the world.</p><p>Starting in 2016, PublicNTP added its first NTP servers outside the United States. It quickly became clear that the need to deploy NTP servers in less-developed parts of the world was orders of magnitude more urgent than inside first-world countries such as the US.  Much of the world faces desperately inadequate access to any local network-based time sources--much less high-quality sources.</p><p>At the same time, it became evident that PublicNTP would need to grow bigger and faster than one person could hope to do on their own. I reached out to three decades-long friends and peers, Dan Noland, Brad Woodfin, and Scott Waddel, and invited them to help PublicNTP make the transitions needed to take on a much bigger challenge.</p><p>On July 26, 2017, the Commonwealth of Virginia issued PublicNTP, Inc. its <a href='/documents/certificate_of_incorp.pdf'>certificate of incorporation</a> as a nonstock corporation, with Dan, Brad, Scott, and I serving as the first four directors and officers.</p><p>In early August 2017, the Internal Revenue Service granted PublicNTP, Inc. <a href='/documents/acceptance_letter.pdf'>tax-exempt public charity status</a> (commonly known as a “501(c)(3)” nonprofit corporation).</p><p>As with all IRS-recognized 501(c)(3) public charities, <a href='/donate.html'>charitable contributions</a> to PublicNTP (both cash and noncash) are now tax-deductible to the <a href='https://www.irs.gov/pub/irs-pdf/p526.pdf'>limits allowed by the IRS</a>. Consult your tax advisor regarding how charitable contributions to PublicNTP can benefit your personal financial situation.</p><p>PublicNTP started in 2008 with a single time server in the midwest United States. As of this writing, PublicNTP has deployed servers across 22 cities, 15 countries, and six continents. The newly-gained ability to accept <a href='/donate.html'>charitable donations</a> empowers PublicNTP to deliver on its mission statement of improving unrestricted access to no-cost, highly-accurate time sources in those parts of the world with the most dire shortage of publicly-accessible NTP servers.</p><p>More developed parts of the world often take a robust infrastructure, including access to highly-accurate time references, for granted.  Access to a robust infrastructure reduces the difficulties of making a wide variety of breakthroughs, technological as well as social.</p><p><a href='/donate.html'>Charitable donations</a> will enable PublicNTP to continue its decades-long effort to gradually improve the global IT infrastructure. On behalf of PublicNTP, I hope you’ll consider supporting our efforts!</p>",
    "tags": ["Time Server Deployments", "Mission Statement"]
  },
  {
    "permalink": "publicntp-partners-network-time-foundation",
    "timestamp": "2018-05-14T14:11:00-05:00",
    "title": "PublicNTP partners with Network Time Foundation",
    "excerpt":
      "Network Time Protocol (NTP) remains one of the oldest and most fundamental internet protocols in use. It has provided a bedrock of reliable time for us since 1985. NTP started out rough, as all innovations do",
    "image_urls": ["images/servers.png"],
    "content":
      "<h4>Terry D. Ott - 2018-05-14, 2:00pm EDT (UTC -0400)</h4><p>Network Time Protocol (NTP) remains one of the oldest and most fundamental internet protocols in use. It has provided a bedrock of reliable time for us since 1985. NTP started out rough, as all innovations do, providing us with accurate time within 100 milliseconds across the few hosts on the network. With faster computers, more reliable networks, and research resulting in four different versions of the NTP protocol, the accuracy has improved exponentially.</p><p>In order to emphasize the integral role that NTP plays in PublicNTP’s vision and mission, we included it in our company’s name. In order to support PublicNTP’s global deployment of NTP servers, PublicNTP has established formal ties with the source of NTP software.</p><p>PublicNTP is proud to officially announce we have been accepted as an <a href='https://www.nwtime.org/current-members-donors/'>Insitutional Member</a> of the <a href='https://www.nwtime.org/'>Network Time Foundation</a> -- the non-profit public charity responsible for maintaining the source for the NTP reference implementation.</p><p>Network Time Foundation (NTF) has been an IRS-recognized public charity since 2014, but came into existence several decades before then. The NTF team, led by president Harlan Stenn, has worked closely with Professor <a href='https://en.wikipedia.org/wiki/David_L._Mills'>David L. Mills</a>, the original inventor of NTP, since 1990. NTF has ensured that Professor Mills’ pioneering work to enable global, synchronized time continues to improve and meet the evolving needs of today’s increasingly-digital society.</p><p>Network Time Foundation’s passion enables PublicNTP to deliver on our mission. PublicNTP is proud to partner with Network Time Foundation as an Institutional Member, and we look forward to working more closely together as a result.</p>",
    "tags": ["Time Server Deployments", "Mission Statement"]
  }
]
